
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2023.2.307.5.10
# Date: 2024-11-11 18:32

# Copyright (C) 2013 - 2023 Efinix Inc. All rights reserved.

# Device: T35F324
# Project: T35_Sensor_DDR3_LCD_Test
# Timing Model: C4 (final)

# PLL Constraints
#################
create_clock -period 50.0000 mipi_clkesc_i
create_clock -period 10.0000 mipi_clkcal_i
create_clock -period 10.0000 mipi_pixclk_i
create_clock -period 2.5063 Ddr0Clk
create_clock -period 37.5940 clk_cmos
create_clock -period 13.4409 hdmi_clk1x_i
create_clock -period 6.7204 hdmi_clk2x_i
create_clock -waveform {0.6720 2.0161} -period 2.6882 hdmi_clk5x_i
create_clock -period 10.4167 Axi0Clk
create_clock -period 20.8333 tx_slowclk
create_clock -waveform {1.4881 4.4643} -period 5.9524 tx_fastclk

# GPIO Constraints
####################
create_clock -period <USER_PERIOD> [get_ports {cmos_pclk}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {key0}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {key0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[7]}]

# LVDS RX GPIO Constraints
############################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lcd_pwm}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lcd_pwm}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_trig_o[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_trig_o[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_trig_o[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_trig_o[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {zone_bit0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {zone_bit0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {zone_bit1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {zone_bit1}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {zone_bit2}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {zone_bit2}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_scl_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_scl_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_scl_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_scl_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_sda_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_sda_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_sda_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_sda_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_scl_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_scl_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_scl_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_scl_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_sda_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_sda_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_sda_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_sda_oe}]

# LVDS Rx Constraints
####################

# LVDS TX GPIO Constraints
############################
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~111~1}] -max 0.620 [get_ports {cmos_data[0]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~111~1}] -min 0.310 [get_ports {cmos_data[0]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~110~1}] -max 0.620 [get_ports {cmos_data[1]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~110~1}] -min 0.310 [get_ports {cmos_data[1]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~105~1}] -max 0.620 [get_ports {cmos_data[2]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~105~1}] -min 0.310 [get_ports {cmos_data[2]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~104~1}] -max 0.620 [get_ports {cmos_data[3]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~104~1}] -min 0.310 [get_ports {cmos_data[3]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~99~1}] -max 0.620 [get_ports {cmos_data[4]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~99~1}] -min 0.310 [get_ports {cmos_data[4]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~98~1}] -max 0.620 [get_ports {cmos_data[5]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~98~1}] -min 0.310 [get_ports {cmos_data[5]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~93~1}] -max 0.620 [get_ports {cmos_data[6]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~93~1}] -min 0.310 [get_ports {cmos_data[6]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~92~1}] -max 0.620 [get_ports {cmos_data[7]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~92~1}] -min 0.310 [get_ports {cmos_data[7]}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~81~1}] -max 0.620 [get_ports {cmos_href}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~81~1}] -min 0.310 [get_ports {cmos_href}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~80~1}] -max 0.620 [get_ports {cmos_vsync}]
set_input_delay -clock cmos_pclk -reference_pin [get_ports {cmos_pclk~CLKOUT~80~1}] -min 0.310 [get_ports {cmos_vsync}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_sclk}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_sclk}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl0_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl0_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl0_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl0_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl0_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl0_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl1_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl1_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl1_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl1_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl1_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl1_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl2_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl2_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl2_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl2_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl2_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl2_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl3_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl3_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl3_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl3_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_ctl3_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_ctl3_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_sdat_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_sdat_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_sdat_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_sdat_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {cmos_sdat_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {cmos_sdat_OE}]

# LVDS Tx Constraints
####################
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~55~1}] -max 0.080 [get_ports {hdmi_tx0_o[4] hdmi_tx0_o[3] hdmi_tx0_o[2] hdmi_tx0_o[1] hdmi_tx0_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~55~1}] -min -0.080 [get_ports {hdmi_tx0_o[4] hdmi_tx0_o[3] hdmi_tx0_o[2] hdmi_tx0_o[1] hdmi_tx0_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~49~1}] -max 0.080 [get_ports {hdmi_tx1_o[4] hdmi_tx1_o[3] hdmi_tx1_o[2] hdmi_tx1_o[1] hdmi_tx1_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~49~1}] -min -0.080 [get_ports {hdmi_tx1_o[4] hdmi_tx1_o[3] hdmi_tx1_o[2] hdmi_tx1_o[1] hdmi_tx1_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~43~1}] -max 0.080 [get_ports {hdmi_tx2_o[4] hdmi_tx2_o[3] hdmi_tx2_o[2] hdmi_tx2_o[1] hdmi_tx2_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~43~1}] -min -0.080 [get_ports {hdmi_tx2_o[4] hdmi_tx2_o[3] hdmi_tx2_o[2] hdmi_tx2_o[1] hdmi_tx2_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~61~1}] -max 0.080 [get_ports {hdmi_txc_o[4] hdmi_txc_o[3] hdmi_txc_o[2] hdmi_txc_o[1] hdmi_txc_o[0]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~61~1}] -min -0.080 [get_ports {hdmi_txc_o[4] hdmi_txc_o[3] hdmi_txc_o[2] hdmi_txc_o[1] hdmi_txc_o[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~37~1}] -max 0.080 [get_ports {lvds_tx0_DATA[6] lvds_tx0_DATA[5] lvds_tx0_DATA[4] lvds_tx0_DATA[3] lvds_tx0_DATA[2] lvds_tx0_DATA[1] lvds_tx0_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~37~1}] -min -0.080 [get_ports {lvds_tx0_DATA[6] lvds_tx0_DATA[5] lvds_tx0_DATA[4] lvds_tx0_DATA[3] lvds_tx0_DATA[2] lvds_tx0_DATA[1] lvds_tx0_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~31~1}] -max 0.080 [get_ports {lvds_tx1_DATA[6] lvds_tx1_DATA[5] lvds_tx1_DATA[4] lvds_tx1_DATA[3] lvds_tx1_DATA[2] lvds_tx1_DATA[1] lvds_tx1_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~31~1}] -min -0.080 [get_ports {lvds_tx1_DATA[6] lvds_tx1_DATA[5] lvds_tx1_DATA[4] lvds_tx1_DATA[3] lvds_tx1_DATA[2] lvds_tx1_DATA[1] lvds_tx1_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~25~1}] -max 0.080 [get_ports {lvds_tx2_DATA[6] lvds_tx2_DATA[5] lvds_tx2_DATA[4] lvds_tx2_DATA[3] lvds_tx2_DATA[2] lvds_tx2_DATA[1] lvds_tx2_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~25~1}] -min -0.080 [get_ports {lvds_tx2_DATA[6] lvds_tx2_DATA[5] lvds_tx2_DATA[4] lvds_tx2_DATA[3] lvds_tx2_DATA[2] lvds_tx2_DATA[1] lvds_tx2_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~13~1}] -max 0.080 [get_ports {lvds_tx3_DATA[6] lvds_tx3_DATA[5] lvds_tx3_DATA[4] lvds_tx3_DATA[3] lvds_tx3_DATA[2] lvds_tx3_DATA[1] lvds_tx3_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~13~1}] -min -0.080 [get_ports {lvds_tx3_DATA[6] lvds_tx3_DATA[5] lvds_tx3_DATA[4] lvds_tx3_DATA[3] lvds_tx3_DATA[2] lvds_tx3_DATA[1] lvds_tx3_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~19~1}] -max 0.080 [get_ports {lvds_tx_clk_DATA[6] lvds_tx_clk_DATA[5] lvds_tx_clk_DATA[4] lvds_tx_clk_DATA[3] lvds_tx_clk_DATA[2] lvds_tx_clk_DATA[1] lvds_tx_clk_DATA[0]}]
set_output_delay -clock tx_slowclk -reference_pin [get_ports {tx_slowclk~CLKOUT~19~1}] -min -0.080 [get_ports {lvds_tx_clk_DATA[6] lvds_tx_clk_DATA[5] lvds_tx_clk_DATA[4] lvds_tx_clk_DATA[3] lvds_tx_clk_DATA[2] lvds_tx_clk_DATA[1] lvds_tx_clk_DATA[0]}]

# MIPI RX Constraints
#####################################
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.564 [get_ports {mipi_rx_0_VC_ENA_o[3] mipi_rx_0_VC_ENA_o[2] mipi_rx_0_VC_ENA_o[1] mipi_rx_0_VC_ENA_o[0]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min -0.069 [get_ports {mipi_rx_0_VC_ENA_o[3] mipi_rx_0_VC_ENA_o[2] mipi_rx_0_VC_ENA_o[1] mipi_rx_0_VC_ENA_o[0]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.113 [get_ports {mipi_rx_0_CLEAR}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min -0.157 [get_ports {mipi_rx_0_CLEAR}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.084 [get_ports {mipi_rx_0_VSYNC_i[3] mipi_rx_0_VSYNC_i[2] mipi_rx_0_VSYNC_i[1] mipi_rx_0_VSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.542 [get_ports {mipi_rx_0_VSYNC_i[3] mipi_rx_0_VSYNC_i[2] mipi_rx_0_VSYNC_i[1] mipi_rx_0_VSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.078 [get_ports {mipi_rx_0_HSYNC_i[3] mipi_rx_0_HSYNC_i[2] mipi_rx_0_HSYNC_i[1] mipi_rx_0_HSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.539 [get_ports {mipi_rx_0_HSYNC_i[3] mipi_rx_0_HSYNC_i[2] mipi_rx_0_HSYNC_i[1] mipi_rx_0_HSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.932 [get_ports {mipi_rx_0_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.466 [get_ports {mipi_rx_0_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.002 [get_ports {mipi_rx_0_CNT_i[3] mipi_rx_0_CNT_i[2] mipi_rx_0_CNT_i[1] mipi_rx_0_CNT_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.501 [get_ports {mipi_rx_0_CNT_i[3] mipi_rx_0_CNT_i[2] mipi_rx_0_CNT_i[1] mipi_rx_0_CNT_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.030 [get_ports {mipi_rx_0_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.515 [get_ports {mipi_rx_0_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.947 [get_ports {mipi_rx_0_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.473 [get_ports {mipi_rx_0_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.945 [get_ports {mipi_rx_0_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.472 [get_ports {mipi_rx_0_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.954 [get_ports {mipi_rx_0_ULPS[3] mipi_rx_0_ULPS[2] mipi_rx_0_ULPS[1] mipi_rx_0_ULPS[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.477 [get_ports {mipi_rx_0_ULPS[3] mipi_rx_0_ULPS[2] mipi_rx_0_ULPS[1] mipi_rx_0_ULPS[0]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.564 [get_ports {mipi_rx_1_VC_ENA_o[3] mipi_rx_1_VC_ENA_o[2] mipi_rx_1_VC_ENA_o[1] mipi_rx_1_VC_ENA_o[0]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min -0.069 [get_ports {mipi_rx_1_VC_ENA_o[3] mipi_rx_1_VC_ENA_o[2] mipi_rx_1_VC_ENA_o[1] mipi_rx_1_VC_ENA_o[0]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.113 [get_ports {mipi_rx_1_CLEAR}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min -0.157 [get_ports {mipi_rx_1_CLEAR}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.084 [get_ports {mipi_rx_1_VSYNC_i[3] mipi_rx_1_VSYNC_i[2] mipi_rx_1_VSYNC_i[1] mipi_rx_1_VSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.542 [get_ports {mipi_rx_1_VSYNC_i[3] mipi_rx_1_VSYNC_i[2] mipi_rx_1_VSYNC_i[1] mipi_rx_1_VSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.078 [get_ports {mipi_rx_1_HSYNC_i[3] mipi_rx_1_HSYNC_i[2] mipi_rx_1_HSYNC_i[1] mipi_rx_1_HSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.539 [get_ports {mipi_rx_1_HSYNC_i[3] mipi_rx_1_HSYNC_i[2] mipi_rx_1_HSYNC_i[1] mipi_rx_1_HSYNC_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.932 [get_ports {mipi_rx_1_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.466 [get_ports {mipi_rx_1_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.002 [get_ports {mipi_rx_1_CNT_i[3] mipi_rx_1_CNT_i[2] mipi_rx_1_CNT_i[1] mipi_rx_1_CNT_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.501 [get_ports {mipi_rx_1_CNT_i[3] mipi_rx_1_CNT_i[2] mipi_rx_1_CNT_i[1] mipi_rx_1_CNT_i[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.030 [get_ports {mipi_rx_1_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.515 [get_ports {mipi_rx_1_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.947 [get_ports {mipi_rx_1_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.473 [get_ports {mipi_rx_1_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.945 [get_ports {mipi_rx_1_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.472 [get_ports {mipi_rx_1_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.954 [get_ports {mipi_rx_1_ULPS[3] mipi_rx_1_ULPS[2] mipi_rx_1_ULPS[1] mipi_rx_1_ULPS[0]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.477 [get_ports {mipi_rx_1_ULPS[3] mipi_rx_1_ULPS[2] mipi_rx_1_ULPS[1] mipi_rx_1_ULPS[0]}]

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 0.111 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min -0.053 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.231 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.116 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.321 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.161 [get_ports {jtag_inst1_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.267 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.134 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# DDR Constraints
#####################
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_AADDR_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_AADDR_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ABURST_0[1] DdrCtrl_ABURST_0[0]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ABURST_0[1] DdrCtrl_ABURST_0[0]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_AID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_AID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ALEN_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ALEN_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ALOCK_0[1] DdrCtrl_ALOCK_0[0]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ALOCK_0[1] DdrCtrl_ALOCK_0[0]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ASIZE_0[2] DdrCtrl_ASIZE_0[1] DdrCtrl_ASIZE_0[0]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ASIZE_0[2] DdrCtrl_ASIZE_0[1] DdrCtrl_ASIZE_0[0]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ATYPE_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ATYPE_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_AVALID_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_AVALID_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_BREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_BREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_RREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_RREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WDATA_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WDATA_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WLAST_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WLAST_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WSTRB_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WSTRB_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WVALID_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_AREADY_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_AREADY_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_BID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_BID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_BVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_BVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RDATA_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RDATA_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RLAST_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RLAST_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RRESP_0[1] DdrCtrl_RRESP_0[0]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RRESP_0[1] DdrCtrl_RRESP_0[0]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_WREADY_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_WREADY_0}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <pll_clk_latency_tx_slowclk_max + 4.310> [get_ports {mipi_clkesc_i}]
# set_clock_latency -source -hold <pll_clk_latency_tx_slowclk_min + 2.155> [get_ports {mipi_clkesc_i}]
# set_clock_latency -source -setup <pll_clk_latency_tx_slowclk_max + 4.310> [get_ports {mipi_clkcal_i}]
# set_clock_latency -source -hold <pll_clk_latency_tx_slowclk_min + 2.155> [get_ports {mipi_clkcal_i}]
# set_clock_latency -source -setup <pll_clk_latency_tx_slowclk_max + 4.310> [get_ports {mipi_pixclk_i}]
# set_clock_latency -source -hold <pll_clk_latency_tx_slowclk_min + 2.155> [get_ports {mipi_pixclk_i}]
# set_clock_latency -source -setup <board_max + 1.589> [get_ports {Ddr0Clk}]
# set_clock_latency -source -hold <board_min + 0.794> [get_ports {Ddr0Clk}]
# set_clock_latency -source -setup <board_max + 1.589> [get_ports {clk_cmos}]
# set_clock_latency -source -hold <board_min + 0.794> [get_ports {clk_cmos}]
# set_clock_latency -source -setup <pll_clk_latency_tx_slowclk_max + 4.310> [get_ports {hdmi_clk1x_i}]
# set_clock_latency -source -hold <pll_clk_latency_tx_slowclk_min + 2.155> [get_ports {hdmi_clk1x_i}]
# set_clock_latency -source -setup <pll_clk_latency_tx_slowclk_max + 4.310> [get_ports {hdmi_clk2x_i}]
# set_clock_latency -source -hold <pll_clk_latency_tx_slowclk_min + 2.155> [get_ports {hdmi_clk2x_i}]
# set_clock_latency -source -setup <pll_clk_latency_tx_slowclk_max + 4.310> [get_ports {hdmi_clk5x_i}]
# set_clock_latency -source -hold <pll_clk_latency_tx_slowclk_min + 2.155> [get_ports {hdmi_clk5x_i}]
# set_clock_latency -source -setup <board_max + 1.589> [get_ports {Axi0Clk}]
# set_clock_latency -source -hold <board_min + 0.794> [get_ports {Axi0Clk}]
# set_clock_latency -source -setup <board_max + 1.589> [get_ports {tx_slowclk}]
# set_clock_latency -source -hold <board_min + 0.794> [get_ports {tx_slowclk}]
# set_clock_latency -source -setup <board_max + 1.589> [get_ports {tx_fastclk}]
# set_clock_latency -source -hold <board_min + 0.794> [get_ports {tx_fastclk}]
# set_clock_latency -source -setup <board_max + 1.275> [get_ports {cmos_pclk}]
# set_clock_latency -source -hold <board_min + 0.637> [get_ports {cmos_pclk}]
